app/views/vehicles/_form.html.erb

    <%= f.label :brand %><br />
    <%= f.collection_select :brand_id, Brand.all, :id, :name %>
---
SELECT "brands".* FROM "brands"

    <%= f.label :vehicle_type %><br />
    <%= f.collection_select :vehicle_type_id, VehicleType.all, :id, :name %>
---
SELECT "vehicle_types".* FROM "vehicle_types"

    <%= f.label :customer %><br />
    <%= f.collection_select :customer_id, Customer.all, :id, :name %>
---
SELECT "customers".* FROM "customers"